Repository: xixi4Den/Teachersteams
Catalog: Presentation/Teachersteams.Presentation/Resources/Resource.*.resx
Languages: ru_ru

# AboutTabTitle
source: About
ru_ru: О приложении

# BoardTabTitle
source: Board
ru_ru: Доска

# CloseButtonLabel
source: Close
ru_ru: Закрыть

# CreateButtonLabel
source: Create
ru_ru: Создать

# CreateGroupButtonLabel
source: Create Group
ru_ru: Создать Группу

# CreateGroupDialogTitle
source: Create a new group
ru_ru: Создать новую группу

# GroupDescriptionIsLongValidationMessage
source: Group description is too long
ru_ru: Описание группы слишком длинное

# GroupDescriptionPlaceholderMessage
source: Here you can describe groupe in more details
ru_ru: Здесь Вы можете описать группу более детально

# GroupsTabTitle
source: Groups
ru_ru: Группы

# GroupTitleIsLongValidationMessage
source: Group title is too long
ru_ru: Название группы слишком длинное

# GroupTitleIsRequiredValidationMessage
source: Group title is required
ru_ru: Название группы обязательно для ввода

# GroupTitlePlaceholderMessage
source: Enter a group title
ru_ru: Введине название учебной группы

# HeaderGroups
source: Groups
ru_ru: Группы

# NotFoundDescription
source: You Requested the page that is no longer There.
ru_ru: Вы запрашиваете страницу которой не существует.

# NotificationsTabTitle
source: Notification
ru_ru: Уведомления

source: Ohh
ru_ru: Упс

# OhhFirstPart
source: O
ru_ru: У

# OhhSecondPart
source: hh.....
ru_ru: пс.....

# SiteHeaderText
source: TeachersTeams
ru_ru: УчительТим

# SiteTitle
source: Teachersteams
ru_ru: Учитель тим

# SorryString
source: Sorry
ru_ru: Извиняемся за неудобства

# StudentSwitchLabel
source: Student
ru_ru: Студент

# TeachersGroupsSubHeader
source: where you are a teacher
ru_ru: в которых вы преподаете

# TeacherSwitchLabel
source: Teacher
ru_ru: Учитель

# UnexpectedErrorDescription
source: OOPS! Unexpected Error Occurred!
ru_ru: УПС! Что-то пошло не так!

# UnexpectedErrorTitle
source: Unknown error
ru_ru: Неизвестная ошибка

# GroupCreateDateLabel
source: Creation Date
ru_ru: Дата создания

# GroupDescriptionLabel
source: Description
ru_ru: Описание

# GroupInfoTabTitle
source: Info
ru_ru: Информация

# GroupOwnerLabel
source: Owner
ru_ru: Владелец

# GroupStudentsTabTitle
source: Students
ru_ru: Студенты

# GroupAssignmentsTabTitle
source: Assignments
ru_ru: Задачи

# GroupTeachersTabTitle
source: Teachers
ru_ru: Учителя

# GroupTitleLabel
source: Title
ru_ru: Заголовок

# FieldIsRequiredValidationMessage
source: Please fill in this field. It cannot be empty.
ru_ru: Заполните это поле. Оно обязательное для ввода.

# InviteButtonLabel
source: Invite
ru_ru: Пригласить

# InviteTeacherDilaogTitle
source: Invite teacher
ru_ru: Пригласить учителя

# NoResultsMessage
source: No resoults
ru_ru: Ничего не найдено

# TeacherNamePlaseholderMessage
source: Type user name here
ru_ru: Введите имя учителя здесь

source: No items
ru_ru: Нет данных

# TeachersGridActionsColumnName
source: Actions
ru_ru: Действия

# TeachersGridFullNameColumnName
source: Full Name
ru_ru: Имя

# TeachersGridPhotoColumnName
source: Photo
ru_ru: Фото

# InviteStudentDilaogTitle
source: Invite student
ru_ru: Пригласить студента

# StudentsGroupsSubHeader
source: where you are a student
ru_ru: в которых вы учитесь

# NoGroupsMessage
source: No groups
ru_ru: Пусто.

# NoGroupsDescriptionForStudent
source: You do not study in any group.
ru_ru: Вы еще не начали обучаться ни в одной группе.

# NoGroupsDescriptionForTeacher
source: There are not groups that satisfied the selected filter.
ru_ru: Нет ни одной группы, которая соответствуют выбранному фильтру.

# AllGroupsFilterText
source: All
ru_ru: Все

# AssistantGroupsFilterText
source: Assistant
ru_ru: Помощник

# OwnGroupsFilterText
source: Own
ru_ru: Мои

# InvitationMessageForStudent
source: You have been invited to study in group
ru_ru: Вас пригласили обучаться в группе

# InvitationMessageForTeacher
source: You have been invited to teach in group
ru_ru: Вас пригласили преподавать в группе

# AcceptButtonLabel
source: Accept
ru_ru: Подтвердить

# DeclineButtonLabel
source: Decline
ru_ru: Отклонить

# InvitedMessage
source: You are invited.
ru_ru: Вы приглашены.

# NoButtonLabel
source: No
ru_ru: Нет

# StudentConfirmationMessage
source: Do you accept to study in this group?
ru_ru: Вы согласны учиться в этой группе?

# TeacherConfirmationMessage
source: Do you accept to teach in this group?
ru_ru: Вы согласны преподавать в этой группе?

# YesButtonLabel
source: Yes
ru_ru: Да

# NoNotificationsMessage
source: There are no new notifications yet.
ru_ru: Новые уведомления отсутствуют.

# DeleteStudentTooltipMessage
source: Remove this user from list of students.
ru_ru: Удалить пользователя из списка студентов.

# DeleteTeacherTooltipMessage
source: Remove this user from list of teachers.
ru_ru: Удалить пользователя из списка учителей.

# DeleteUserConfirmationMessage
source: Do you really want to remove
ru_ru: Вы действительно хотите удалить

# DeleteUserDialogTitle
source: Delete User
ru_ru: Удалить пользователя

# EditPermissionsDialogTitle
source: Edit permissions
ru_ru: Редактирование прав пользователя

# EditPermissionsTooltipMessage
source: Edit permissions of this user.
ru_ru: Редактировать права пользователя.

# ViewGradesDialogTitle
source: View Grades
ru_ru: Оценки

# ViewGradesTooltipMessage
source: View grades of this student.
ru_ru: Посмотреть оценки студента.

# AllUsersUserSearchTypeName
source: All Users
ru_ru: Все пользователи

# OnlyFriendsUserSearchTypeName
source: Only Friends
ru_ru: Только друзья

# CreateAssignmentButtonLabel
source: Create assignment
ru_ru: Создать задание

# AddAssignmentDialogCloseConfirmationMessage
source: Are you sure you want to close without saving your changes?
ru_ru: Вы уверены, что хотите закрыть окно без сохранения изменений?

# AssignmentCreatedMessage
source: A new assignment has been created.
ru_ru: Новое задание создано.

# AssignmentDescriptionIsLongValidationMessage
source: Assignment description is too long.
ru_ru: Описание задания слишком длинное.

# AssignmentDescriptionPlaceholderMessage
source: Here you can describe assignment in more details
ru_ru: Здесь Вы можете описать задание более детально

# AssignmentExpirationDateIsInvalidValidationMessage
source: Assignment expiration date is invalid.
ru_ru: Дата активности задания некорректна.

# AssignmentExpirationDateIsRequiredValidationMessage
source: Assignment expiration date is required.
ru_ru: Дата активности задания обязательна для ввода.

# AssignmentTitleIsLongValidationMessage
source: Assignment title is too long.
ru_ru: Название задания слишком длинное.

# AssignmentTitleIsRequiredValidationMessage
source: Assignment title is required.
ru_ru: Название задания обязательно для ввода.

# AssignmentTitlePlaceholderMessage
source: Enter a assignment title
ru_ru: Введине название задания

# BrowseButtonLabel
source: Browse
ru_ru: Обзор

# CreateAssignmentDialogTitle
source: Create Assignment
ru_ru: Создать задание

# FileIsNotAttachedMessage
source: Please attach a file.
ru_ru: Прикрепите файл.

# UploadingToCloudMessage
source: Uploading to cloud...
ru_ru: Загрузка в облоко...

# AssignmentsGridExpirationColumnName
source: Expiration
ru_ru: Срок

# AssignmentsGridStatusColumnName
source: Status
ru_ru: Статус

# AssignmentsGridTitleColumnName
source: Title
ru_ru: Заголовок

# AssignmentStatusEnumActive
source: Active
ru_ru: Активное

# AssignmentStatusEnumDraft
source: Draft
ru_ru: Черновик

# AssignmentStatusEnumExpired
source: Expired
ru_ru: Неактивное
